MortageAndLoanServiceCA/test/TestCase2/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:mor="http://j2ee.netbeans.org/wsdl/MortageAndLoanService/src/MortageAndLoanServiceWSDL">
  <soapenv:Body>
    <mor:MortageAndLoanServiceWSDLOperation>
      <MortageYears>0</MortageYears>
      <MortageInterest>10</MortageInterest>
      <MortageLoanAmount>0</MortageLoanAmount>
      <MortageAnnualTax>150</MortageAnnualTax>
      <MortageAnnualInsurance>250</MortageAnnualInsurance>
      <CurrencyFrom>eur</CurrencyFrom>
      <CurrencyTo>gbp</CurrencyTo>
      <LoanAmount>1000</LoanAmount>
      <InterestRate>7</InterestRate>
      <Months>10</Months>
    </mor:MortageAndLoanServiceWSDLOperation>
  </soapenv:Body>
</soapenv:Envelope>